{
    "modelTopology": {
        "keras_version": "2.2.4",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [ {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_1", "trainable": true, "batch_input_shape": [null, 28, 28], "dtype": "float32", "data_format": "channels_last"
                    }
                }
                ,
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null
                            }
                        }
                        ,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                        ,
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
                ,
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null
                            }
                        }
                        ,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                        ,
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
                ,
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_3",
                        "trainable": true,
                        "units": 62,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null
                            }
                        }
                        ,
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                        ,
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
                ]
            }
        }
        ,
        "training_config": {
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "lr": 9.999999747378752e-06, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false
                }
            }
            ,
            "loss": "sparse_categorical_crossentropy",
            "metrics": ["mean_absolute_error"],
            "sample_weight_mode": null,
            "loss_weights": null
        }
    }
    ,
    "weightsManifest": [ {
        "paths": ["group1-shard1of1"],
        "weights": [ {
            "name": "dense_1/kernel", "shape": [784, 128], "dtype": "float32"
        }
        ,
        {
            "name": "dense_1/bias", "shape": [128], "dtype": "float32"
        }
        ,
        {
            "name": "dense_2/kernel", "shape": [128, 128], "dtype": "float32"
        }
        ,
        {
            "name": "dense_2/bias", "shape": [128], "dtype": "float32"
        }
        ,
        {
            "name": "dense_3/kernel", "shape": [128, 62], "dtype": "float32"
        }
        ,
        {
            "name": "dense_3/bias", "shape": [62], "dtype": "float32"
        }
        ]
    }
    ]
}