{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 28, 28], "name": "flatten_1", "dtype": "float32", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "trainable": true, "units": 128, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "trainable": true, "units": 62, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null}}]}, "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss": "sparse_categorical_crossentropy", "metrics": ["mean_absolute_error"], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "decay": 0.0, "beta_1": 0.8999999761581421, "lr": 9.999999747378752e-06, "amsgrad": false, "beta_2": 0.9990000128746033}}}, "keras_version": "2.2.2"}, "weightsManifest": [{"weights": [{"shape": [784, 128], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [128, 128], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [128], "name": "dense_2/bias", "dtype": "float32"}, {"shape": [128, 62], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [62], "name": "dense_3/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}]}